package interview.airbnb;

/**
 *电面, 先看符漫画 http://xkcd.com/287/
然后你的目的是实现一个这样的函数, 根据菜单回答问题: 我怎么点餐能恰好花掉X刀?
例如: 从菜单上怎么点餐能恰好花掉15.05刀?

陷阱1: 老中点餐一个菜不会点多次, 这个可以点多次
陷阱2: 价格不能用float,否则答案会因为floato精度问题少一组.

楼主因第2个陷阱而跪, 虽然能编译，能跑, 但少了一组答案

 
电面二话不说上来就做题
一个餐馆，菜单上各种食物价格如下
A， $ X.XX
B， $ Y.YY
C， $ Z.ZZ
D,  $ ...

问现在一个人有 一定数额的钱，如何点菜才能把钱全部花完？
我用了recursive的方法，写出来了
但是在 比较 float number的时候，细节没有处理好
直接比较 X.XX == Y.YY 会出现错误，所以必须要做差来比较
经面试官提醒改了过来
然后周一被通知挂了 
 */

public class OrderFood
{
}
